Repository: MohamedAshrafMadkour/sakina_app
Catalog: lib/l10n/app_*.arb
Languages: fr, ur

# splashViewTitle
source: Al-Mushaf Al-Sharif
ur: المصحف شریف

# splashViewSubTitle
source: Recite the Quran with tartil
fr: ﴿ Récitez le Coran avec récitation mesurée ﴿
ur: ﴾ قرآن کو ماپ کر پڑھیں ﴿

# splashViewDesc
source: Surah Al-Muzzammil - Verse 4
fr: Sourate Al-Muzzammil - Verset 4
ur: سورہ المزمل - آیت 4

# firstOnBoardingTitle
source: The Holy Quran
fr: Le Saint Coran
ur: قرآن مجید

# firstOnBoardingSubTitle
source: Read the Quran clearly with beautiful design and listen to recitations
fr: Lisez le Coran avec une police claire et un design agréable et écoutez les récitations
ur: قرآن کو واضح خط اور خوبصورت ڈیزائن کے ساتھ پڑھیں اور تلاوت سنیں

# secondOnBoardingTitle
source: Prayer Times
fr: Heures de prière
ur: نماز کے اوقات

# secondOnBoardingSubTitle
source: Accurate notifications for prayer times according to your location with Adhan sound
fr: Notifications précises pour les heures de prière selon votre position avec son d'adhan
ur: آپ کے مقام کے مطابق درست نماز کے اوقات کے لیے اطلاعات کے ساتھ اذان کی آواز

# thirdOnBoardingTitle
source: Your Spiritual Companion
fr: Votre compagnon spirituel
ur: آپ کا روحانی ساتھی

# thirdOnBoardingSubTitle
source: Daily reminders, Azkar, Tasbeeh, everything you need in your spiritual journey
fr: Rappels quotidiens, adhkar, tasbih, tout ce dont vous avez besoin dans votre parcours spirituel
ur: روزانہ یاد دہانیاں، اذکار، تسبیح، جو کچھ آپ کی روحانی زندگی کے لیے ضروری ہے

# skipText
source: Skip
fr: Passer
ur: چھوڑیں

# onBoardingButtonbuttonText
source: Continue
fr: Continuer
ur: جاری رکھیں

# languageSelectionTitle
source: Choose Language
fr: Choisir la langue
ur: زبان منتخب کریں

# firstLanguage
source: Arabic
fr: Arabe
ur: عربی

# secondLanguage
source: English
fr: Anglais
ur: انگریزی

# thirdLanguage
source: Urdu
ur: اردو

# fourthLanguage
source: French
fr: Français
ur: فرانسیسی

# identifyLocationTitle
source: Location
fr: Autorisation de localisation
ur: مقام کی اجازت

# identifyLocationSubTitle
source: We need your location to calculate accurate prayer times
fr: Nous avons besoin de votre position pour calculer les heures de prière exactes et montrer les mosquées à proximité
ur: ہمیں درست نماز کے اوقات معلوم کرنے کے لیے آپ کا مقام درکار ہے اور قریبی مساجد دکھائیں

# firstLocationListTile
source: Accurate prayer times
fr: Heures de prière exactes
ur: درست نماز کے اوقات

# secondLocationListTile
source: Nearby mosques
fr: Mosquées à proximité
ur: قریبی مساجد

# thirdLocationListTile
source: Privacy protected
fr: Confidentialité protégée
ur: محفوظ پرائیویسی

# firstLocationListTileSubTitle
source: Calculated based on your location
fr: Calculé avec précision en fonction de votre position
ur: آپ کے مقام کی بنیاد پر درست طریقے سے حساب کیا گیا

# secondLocationListTileSubTitle
source: Discover nearby mosques
fr: Découvrez les mosquées autour de vous
ur: آپ کے آس پاس مساجد دریافت کریں

# thirdLocationListTileSubTitle
source: Your data is safe and protected
fr: Vos données sont sécurisées et protégées
ur: آپ کا ڈیٹا محفوظ اور محفوظ ہے

# selectionLocationButtonText
source: Allow location access
fr: Autoriser l'accès à la localisation
ur: مقام تک رسائی کی اجازت دیں

# selectionLocationSetting
source: You can change this later in settings
fr: Vous pouvez modifier ce paramètre plus tard depuis les paramètres
ur: آپ اس سیٹنگ کو بعد میں سیٹنگز سے تبدیل کر سکتے ہیں

# chooseLanguageSnackBar
source: Please choose a language
fr: Veuillez choisir votre langue
ur: براہ کرم زبان منتخب کریں
